{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "# Задача №1\n",
    "https://stepik.org/lesson/806237/step/2?unit=809366\n",
    "\n",
    "В доме несколько подъездов. В каждом подъезде одинаковое количество квартир. Квартиры нумеруются подряд, начиная с единицы. Может ли в некотором подъезде первая квартира иметь номер x, а последняя – номер y?\n",
    "\n",
    "Входные данныеВводятся два натуральных числа x и y (x ≤ y), не превышающие 10 000.\n",
    "\n",
    "Выходные данные:\n",
    "Выведите слово YES, если такое возможно, и NO в противном случае.\n",
    "\n",
    "описание решения:\n",
    "Данные вводятся произвольные, с соблюдением того, что это должны быть два натуральных числа, и x < y. Поэтому:\n",
    "\n",
    "1. Для того, чтобы вычислить гипотетическое количество квартир в подъезде, нужно из номера последней квартиры вычесть количество квартир, которые должны находиться до первой квартиры \n",
    "```\n",
    "y - (x - 1)\n",
    "```\n",
    "2. В доме должно быть целое количество подъездов, и в каждом подъезде одинаковое число квартир. Следовательно, количество квартир в предыдущих подъездах должно быть кратно количеству квартир в подъезде с заданными номерами."
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "aefbb7f2714ff1c2"
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "x, y = map(int, input().split())\n",
    "\n",
    "if (x - 1) % (y - (x - 1)) == 0:\n",
    "    print('YES')\n",
    "else:\n",
    "    print('NO')"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "8271efe121fb1fd6"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Задача №2\n",
    "https://stepik.org/lesson/806237/step/3?unit=809366\n",
    "\n",
    "Программа принимает три числа: возраст Антона, возраст Бориса и возраст Виктора. Определите, кто из них старше остальных.\n",
    "\n",
    "Входные данные\n",
    "Входная строка содержит три натуральных числа: возраст Антона, возраст Бориса и возраст Виктора.\n",
    "\n",
    "Выходные данные\n",
    "Выходная строка должна содержать латинскую букву – код того человека, который старше всех. Код Антона – 'A', код Бориса – 'B', код Виктора – 'C'. Если двое старше третьего, нужно вывести два кода через пробел (в алфавитном порядке). Например, если Антон и Виктор старше Бориса, программа должна вывести 'A C'. Если все трое одного возраста, программа должна вывести число 0."
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "2e1199ffdea0462c"
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "def get_result(data: dict):\n",
    "    result = list()\n",
    "    tmp_result = max(data, key=data.get)\n",
    "    for key, value in data.items():\n",
    "        if value == data[tmp_result]:\n",
    "            result.append(key)\n",
    "    if len(result) == 3:\n",
    "        return 0\n",
    "    return(' '.join(sorted(result)))\n",
    "    \n",
    "\n",
    "data = dict(zip(['A','B','C'], \n",
    "                map(int, input().split())\n",
    "                )\n",
    "            )\n",
    "\n",
    "print(get_result(data))"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "188fb9adbd9b727"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Задача №4\n",
    "https://stepik.org/lesson/806237/step/4?unit=809366\n",
    "\n",
    "Для заезда в оздоровительный лагерь организаторы решили заказать автобусы. Известно, что в лагерь собираются поехать N детей и M взрослых. Каждый автобус вмещает K человек. В каждом автобусе, в котором поедут дети, должно быть не менее двух взрослых.\n",
    "\n",
    "Определите, удастся ли отправить в лагерь всех детей и взрослых, и если да, то какое минимальное количество автобусов требуется для этого заказать.\n",
    "\n",
    "Входные данные\n",
    "На вход программы поступают 3 натуральных числа, записанных через пробел - N, M и K, каждое из них не превосходит 10 000.\n",
    "\n",
    "Выходные данные:\n",
    "Выведите количество автобусов, которые нужно заказать. Если же отправить всех в лагерь невозможно, выведите число 0."
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "68a80f852e167c57"
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "from math import ceil as roundup\n",
    "n, m, k = map(int, input().split())\n",
    "count_passagers = n + m\n",
    "count_bus = roundup(count_passagers / k)\n",
    "count_parrents = m // count_bus\n",
    "\n",
    "if count_parrents >= 2:\n",
    "    print(count_bus)\n",
    "else:\n",
    "    print(0)"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "de4cb4a8e8d4e94d"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
